Config/Catalogs/ВидыДокументовОснованийЕБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыДокументовОснованийЕБП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КВР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыДокументовОснованийЕБП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузитьЭлементы");
КонецПроцедуры

#КонецОбласти

Процедура ЗагрузитьЭлементы() Экспорт
	
	Макет = ПолучитьМакет("ДокументыОснования");
	ОбластьНаименование	= Макет.ПолучитьОбласть("Наименование");
	ОбластьОписание	= Макет.ПолучитьОбласть("Описание");
	ОбластьНазначение	= Макет.ПолучитьОбласть("НазначениеПлатежа"); 
	ОбластьКВР	= Макет.ПолучитьОбласть("КВР"); 
		
	н = 0;
	Пока (Истина) Цикл
		н = н + 1; 
		
		ТекНаименование = СокрЛП(ОбластьНаименование.Область(н, 1).Текст);
		
		Если НЕ ЗначениеЗаполнено(ТекНаименование) Тогда
			Прервать;
		КонецЕсли;    
		
		ТекСсылка = НайтиПоНаименованию(ТекНаименование, Истина);  
		
        Если ТекСсылка.Пустая() Тогда
			ТекОбъект = СоздатьЭлемент();
			ТекОбъект.Наименование = ТекНаименование;
		Иначе
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
		КонецЕсли;   
		
		Если НЕ ЗначениеЗаполнено(ТекОбъект.Код) Тогда
			ТекОбъект.УстановитьНовыйКод();
		КонецЕсли;	
		
		ТекОбъект.Описание = СокрЛП(ОбластьОписание.Область(н, 1).Текст); 
		ТекОбъект.НазначениеПлатежа = СокрЛП(ОбластьНазначение.Область(н, 1).Текст) = "+";   
		ТекОбъект.КВР = СокрЛП(ОбластьКВР.Область(н, 1).Текст);

		ТекОбъект.Записать();

	КонецЦикла;
	
КонецПроцедуры	

Функция ВидОснованияПоНаименованию(НаименованиеВида, ТекстНазначенияПлатежа, Создавать = Истина) Экспорт 
	
	ВидОснования = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВидыДокументовОснованийЕБП.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыДокументовОснованийЕБП КАК ВидыДокументовОснованийЕБП
	|ГДЕ
	|	ВидыДокументовОснованийЕБП.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование", НаименованиеВида);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВидОснования = Выборка.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(НаименованиеВида) И Создавать Тогда
		НовоеОснование = Справочники.ВидыДокументовОснованийЕБП.СоздатьЭлемент();
		НовоеОснование.УстановитьНовыйКод();
		НовоеОснование.Наименование = НаименованиеВида;
		НовоеОснование.НазначениеПлатежа = СтрНайти(ТекстНазначенияПлатежа, НаименованиеВида) > 0;
		НовоеОснование.Записать();
		ВидОснования = НовоеОснование.Ссылка;
	КонецЕсли;
	
	Возврат ВидОснования;
	
КонецФункции

#КонецОбласти
 
#КонецЕсли
